demo/demo/api_tests/__tenant_operation_id_get_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test raml-swagger-artillery using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /_/tenant/{operation_id}_get for http method type GET in artillery framework
# RoostTestHash=139c0a46b1
# 
# 

# ********RoostGPT********
config:
  target: "{{ API_HOST }}"
  plugins:
    expect: {}
  payload:
    path: "__tenant_operation_id_get_success.csv"
    fields:
      - operation_id
    skipHeader: true
    order: sequence
    delimiter: "^|^"
  headers:
    Authorization: "Bearer {{ AUTH_TOKEN }}"
  phases:
    - duration: 60
      arrivalRate: 5
  variables:
    API_HOST: "your_api_host_here"
    AUTH_TOKEN: "your_auth_token_here"

scenarios:
  - name: "Tenant job success scenario"
    flow:
      - log: "Starting scenario for tenant job success"
      - get:
          url: "/_/tenant/{{ operation_id }}"
          headers:
            Authorization: "Bearer {{ AUTH_TOKEN }}"
          expect:
            - statusCode: 200
            - hasProperty: "value.id"
            - hasProperty: "value.tenant"
            - hasProperty: "value.tenantAttributes.module_to"
            - hasProperty: "value.tenantAttributes.module_from"
            - hasProperty: "value.tenantAttributes.parameters"
            - hasProperty: "value.complete"
            - hasProperty: "value.error"
            - hasProperty: "value.messages"
      - think: 1