demo/demo/api_tests/__tenant_post_others.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test raml-swagger-artillery using AI Type Open AI and AI Model gpt-4
# 
# Test generated for /_/tenant_post for http method type POST in artillery framework
# RoostTestHash=4b8c14d754
# 
# 

# ********RoostGPT********
config:
  target: "processEnvironment.API_HOST"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "__tenant_post_others.csv"
    fields:
      - "module_from"
      - "module_to"
      - "purge"
      - "parameters"
    skipHeader: true
    delimiter: "^|^"
  plugins:
    expect: {}

scenarios:
  - name: "Tenant API non-success responses test"
    flow:
      - log: "Posting invalid data to /_/tenant"
        post:
          url: "/_/tenant"
          headers:
            Authorization: "Bearer processEnvironment.AUTH_TOKEN"
            Content-Type: "application/json"
          json:
            module_from: "{{ module_from }}"
            module_to: "{{ module_to }}"
            purge: "{{ purge }}"
            parameters: "{{ parameters }}"
          expect:
            - statusCode: 400
            - hasProperty: "errors"
            - hasProperty: "errors[0].message"
            - hasProperty: "errors[0].code"
          think: 1

      - log: "Posting to an invalid URL"
        post:
          url: "/_/invalid"
          headers:
            Authorization: "Bearer processEnvironment.AUTH_TOKEN"
            Content-Type: "application/json"
          json:
            module_from: "{{ module_from }}"
            module_to: "{{ module_to }}"
            purge: "{{ purge }}"
            parameters: "{{ parameters }}"
          expect:
            - statusCode: 404
          think: 1

      - log: "Posting without authorization"
        post:
          url: "/_/tenant"
          headers:
            Content-Type: "application/json"
          json:
            module_from: "{{ module_from }}"
            module_to: "{{ module_to }}"
            purge: "{{ purge }}"
            parameters: "{{ parameters }}"
          expect:
            - statusCode: 401
          think: 1